tap "hashicorp/tap"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "supabase/tap"
brew "zstd"
brew "libtiff"
brew "little-cms2"
brew "glib"
brew "cmatrix"
brew "fd"
brew "fzf"
brew "gh"
brew "git-filter-repo"
brew "harfbuzz"
brew "htop"
brew "httpie"
brew "imagemagick"
brew "jq"
brew "openjdk"
brew "maven"
brew "neovim"
brew "nvm"
brew "openjdk@17"
brew "pdfcpu"
brew "perl"
brew "pipx"
brew "poppler"
brew "python@3.10"
brew "python@3.11"
brew "python@3.9"
brew "qpdf"
brew "ripgrep"
brew "tfenv"
brew "tree"
brew "vim"
brew "wget"
brew "zoxide"
brew "zsh"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
brew "supabase/tap/supabase"
cask "anaconda"
cask "claude-code"
cask "dbeaver-community"
cask "font-hack-nerd-font"
cask "keycastr"
cask "warp"
cask "wkhtmltopdf"
npm "@google/gemini-cli"
npm "@playwright/mcp"
npm "corepack"
