42crunch.vscode-openapi
anthropic.claude-code
dbaeumer.vscode-eslint
eamodio.gitlens
esbenp.prettier-vscode
exodiusstudios.comment-anchors
figma.figma-vscode-extension
github.vscode-pull-request-github
mattpocock.ts-error-translator
mechatroner.rainbow-csv
ms-playwright.playwright
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-vsliveshare.vsliveshare
redhat.java
redhat.vscode-yaml
ritwickdey.liveserver
sonarsource.sonarlint-vscode
streetsidesoftware.code-spell-checker
styled-components.vscode-styled-components
tobias-z.vscode-harpoon
tonka3000.raycast
visualstudioexptteam.intellicode-api-usage-examples
visualstudioexptteam.vscodeintellicode
vscjava.migrate-java-to-azure
vscjava.vscode-java-debug
vscjava.vscode-java-dependency
vscjava.vscode-java-pack
vscjava.vscode-java-upgrade
vscjava.vscode-maven
vscodevim.vim
wallabyjs.console-ninja
wix.vscode-import-cost
